[Lookup:  nvd_db_lookup]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 0 * * *
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = vFeed
request.ui_dispatch_view = search
search = | dbquery "vFeed" "SELECT * FROM nvd_db" | rename cveid AS cve | outputlookup nvd_db_lookup

[Lookup:  cwe_db_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = less than
search = | dbquery "vFeed" "SELECT * FROM cwe_db" | rename cweid AS cwe, cwetitle AS name | outputlookup cwe_db_lookup

[Lookup cwe_category_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM cwe_category" | rename cweid AS cwe, categoryid AS category, categorytitle AS category_name | outputlookup cwe_category_lookup

[Lookup:  cwe_capec_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM cwe_capec" | rename cweid AS cwe, capecid AS capec | outputlookup cwe_capec_lookup

[Lookup:  cve_reference_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM cve_reference" | rename refsource AS xref_type, refname AS xref, cveid AS cve | outputlookup cve_reference_lookup

[Lookup:  cve_aixapar_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_aixapar" | rename cveid AS cve, aixaparid AS aixapar | outputlookup cve_aixapar_lookup

[Lookup:  cve_saint_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_saint" | rename cveid AS cve, saintexploitid AS saint, saintexploittitle AS name, saintexploitlink AS url | search cve=* | outputlookup cve_saint_lookup

[Lookup:  cve_milw0rm_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_milw0rm" | rename cveid AS cve, milw0rmid AS milw0rmn | outputlookup cve_milw0rm_lookup

[Lookup:  cve_osvdb_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_osvdb" | rename osvdbid AS osvdb, cveid AS cve | eval url="http://osvdb.org/show/osvdb/"+osvdb | outputlookup cve_osvdb_lookup

[Lookup:  cve_nessus_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_nessus" | rename nessus_script_id AS nessus, cveid AS cve | eval url="http://www.tenable.com/plugins/index.php?view=single&id="+nessus | outputlookup cve_nessus_lookup

[Lookup:  cve_metasploit_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_msf" | rename msfid AS metasploit, msf_script_file AS metasploit_script_file, msf_script_name AS metasploit_script_name, cveid AS cve | outputlookup cve_metasploit_lookup

[Lookup:  cve_openvas_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_openvas" | rename cveid AS cve, openvas_script_id AS openvas | outputlookup cve_openvas_lookup

[Lookup:  cve_iavm_lookiup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_iavm" | rename iavmid AS iavm, cveid AS cve | outputlookup cve_iavm_lookup

[Lookup:  cve_cisco_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_cisco" | rename ciscoid AS cisco, cveid AS cve | regex cisco="cisco-sa-\d+" | outputlookup cve_cisco_lookup

[Lookup:  cve_ubuntu_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_ubuntu" | rename ubuntuid AS ubuntu, cveid AS cve | eval url="http://www.ubuntu.com/usn/"+ubuntu | outputlookup cve_ubuntu_lookup

[Lookup:  cve_gentoo_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_gentoo" | rename gentooid AS gentoo, cveid AS cve | rex field=gentoo "(?i)(?P<gentoo>\d+-\d+)" | eval url="https://security.gentoo.org/glsa/"+gentoo | outputlookup cve_gentoo_lookup

[Lookup:  cve_fedora_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_fedora" | rename cveid AS cve, fedoraid AS fedora

[Lookup:  cve_certvn_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_certvn" | rename certvuid AS certvu, certvulink AS url, cveid AS cve | outputlookup cve_certvn_lookup

[Lookup:  cve_mskb_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_mskb" | rename mskbid AS mskb, mskbtitle AS name, cveid AS cve | eval url="http://support.microsoft.com/en-us/kb/"+mskb | outputlookup cve_mskb_lookup

[Lookup:  cve_msft_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_ms" | rename msid AS msft, mstitle AS name, cveid AS cve | rex field=cve mode=sed "s/_/-/g" | eval url="https://technet.microsoft.com/en-us/library/security/"+msft+".aspx" | outputlookup cve_msft_lookup

[Lookup:  cve_debian_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_debian" | rename cveid AS cve, debianid AS debian | rex field=cve "CVE-(?P<year>\d+)" | eval debian=substr(debian,1,8) | eval url="https://www.debian.org/security/"+year+"/"+debian | fields - year | outputlookup cve_debian_lookup

[Lookup:  cve_mandriva_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_mandriva" | rename cveid AS cve, mandrivaid AS mandriva | eval url_id=mandriva | rex field=url_id mode=sed "s/:/%3A/g" | eval url="http://www.mandriva.com/en/support/security/advisories/advisory/"+url_id | fields - url_id | outputlookup cve_mandriva_lookup

[Lookup:  cve_redhat_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_redhat" | rename redhatid AS redhat, redhatovalid AS oval, redhatupdatedesc AS description, cveid AS cve | regex cve="CVE-\d+-\d+" | regex redhat="\w+-\d+:\d+" | eval url_id=redhat | rex field=url_id mode=sed "s/:/-/g" | eval url="https://rhn.redhat.com/errata/"+url_id+".html" | fields - url_id | outputlookup cve_redhat_lookup

[Lookup:  cve_scip_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_scip" | rename cveid AS cve, scipd AS scip, sciplink AS url | search cve="CVE-*" | outputlookup cve_scip_lookup

[Lookup:  cve_suse_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = less than
search = | dbquery "vFeed" "SELECT * FROM map_cve_suse" | rename cveid AS cve, suseid AS suse | eval url="https://www.suse.com/security/cve/"+cve+".html" | outputlookup cve_suse_lookup

[Lookup:  cve_snort_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_snort" | rename snort_id AS snort, snort_sig AS signature, snort_classtype AS category, cveid AS cve | eval snort=substr(snort,5,10) | eval url="http://rootedyour.com/snortsid?sid="+snort | outputlookup cve_snort_lookup

[Lookup:  cve_suricata_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_suricata" | rename suricata_id AS suricata, suricata_sig AS signature, suricata_classtype AS category, cveid AS cve | eval suricata=substr(suricata,5,10) | outputlookup cve_suricata_lookup

[Lookup:  cve_vmware_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_vmware" | rename vmwareid AS vmware, cveid AS cve | eval url="http://www.vmware.com/security/advisories/"+vmware | outputlookup cve_vmware_lookup

[Lookup:  cve_bugtraq_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_bid" | rename bidid AS bugtraq, cveid AS cve | eval url="http://www.securityfocus.com/bid/"+bugtraq | outputlookup cve_bugtraq_lookup

[Lookup:  cve_hp_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_hp" | rename hpid AS hp, hplink AS url, cveid AS cve | outputlookup cve_hp_lookup

[Lookup:  cve_exploit_db_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_exploitdb" | rename exploitdbid AS exploit_db, exploitdbscript AS url, cveid AS cve | outputlookup cve_exploit_db_lookup

[Lookup:  cve_oval_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_oval" | rename ovalid AS oval, ovalclass AS class, ovaltitle AS signature, cpeid AS cpe, cveid AS cve | eval url="http://www.security-database.com/ovalid.php?detail="+oval | outputlookup cve_oval_lookup

[Lookup:  cve_d2_lookup]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM map_cve_d2" | rename d2_script_name AS d2, d2_script_file AS url, cveid AS cve | outputlookup cve_d2_lookup

[Lookup:  cve_cwe_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM cve_cwe" | rename cveid AS cve, cweid AS cwe | eval url="http://www.security-database.com/cwe.php?name="+cwe | outputlookup cve_cwe_lookup

[Lookup:  cve_cpe_lookup]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
enableSched = 1
quantity = 0
relation = equal to
search = | dbquery "vFeed" "SELECT * FROM cve_cpe" | rename cveid AS cve, cpeid AS cpe  | eval url="http://www.security-database.com/cpe.php?detail="+cpe | outputlookup cve_cpe_lookup

[Lookup:  Initialize nessus_last_scan_lookup]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = vFeed
request.ui_dispatch_view = search
search = (sourcetype="nessus" AND signature="12053" OR signature="19506") OR sourcetype=snmp_arp | rex field=_raw "(?i)resolves as (?P<hostname>[^$]+)(?=\.)" | rex mode=sed field=dest_mac "s/\s/:/g"| transaction maxspan=1h dest | eval padding=random()/2147483648*86400 | eval last_scan=now()+padding | table last_scan,hostname,dest,dest_mac | outputlookup nessus_last_scan_lookup


[Lookup:  nessus_scan_status_lookup]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = vFeed
request.ui_dispatch_view = search
search = sourcetype=scan_status | rex max_match=100 field=_raw "(?P<scan>\{\"folder_id[^\}]+)" | mvexpand scan | rex field=scan "\"id\":(?P<scan_id>\d+)" | rex field=scan "\"status\":\"(?P<status>\w+)" | search status=completed | table scanner_ip,scan_id,status | outputlookup nessus_scan_status_lookup
